tap "nikitabobko/tap"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Collection of portable C++ source libraries
brew "boost"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# Modern, C++-native, test framework
brew "catch2"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Generate documentation for several programming languages
brew "doxygen"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# GNU debugger
brew "gdb"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Interactive environments for writing and running code
brew "jupyterlab"
# Utility for directing compilation
brew "make"
# Deep clean and optimize your Mac
brew "mole"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# High performance message passing library
brew "open-mpi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Web browser focusing on privacy
cask "brave-browser"
# Colemak mod for more comfortable typing (DH variant)
cask "colemak-dh"
# Voice and text chat software
cask "discord"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"
# GTK+ based wave viewer
cask "gtkwave"
# Control your tools with a few keystrokes
cask "raycast"
# To-do & task list manager
cask "ticktick"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
